packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000023a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CreateCertificateIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>23</pkif:RequestId>
        <pkif:Timestamp>2020-07-20T20:43:20.991708+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<X509Data>
<X509Certificate>MIIFATCCAumgAwIBAgIFAQjv8bkwDQYJKoZIhvcNAQELBQAwgZgxEDAOBgNVBAMT
B0RCR1JPT1QxCzAJBgNVBAYTAkRLMRMwEQYDVQQHEwpDb3BlbmhhZ2VuMRAwDgYD
VQQIEwdEZW5tYXJrMRowGAYDVQQKExFEYW5za2UgQmFuayBHcm91cDEaMBgGA1UE
CxMRRGFuc2tlIEJhbmsgR3JvdXAxGDAWBgNVBAUTDzYxMTI2MjI4MTExMDAwMzAe
Fw0yMDAyMDQxMjAwMDBaFw0yMjAyMDQxMjAwMDBaMIGYMRAwDgYDVQQDEwdEUENS
WVBUMQswCQYDVQQGEwJESzETMBEGA1UEBxMKQ29wZW5oYWdlbjEQMA4GA1UECBMH
RGVubWFyazEaMBgGA1UEChMRRGFuc2tlIEJhbmsgR3JvdXAxGjAYBgNVBAsTEURh
bnNrZSBCYW5rIEdyb3VwMRgwFgYDVQQFEw82MTEyNjIyODQ5MTAwMDkwggEgMA0G
CSqGSIb3DQEBAQUAA4IBDQAwggEIAoIBAQCmSUzQYj0Fx3jwvkz0lhmyyXRKwo5T
hts+1xFrG7euQ6oIMUJJpr8tgKxwDxdxxK/RXaYCHRH9mpIoyxCPlS3reRF4BMB6
gL2KOINnRyC3jmJ7kYHyWdhYfMb5VPIvusqPXc91HdVJb6rxvVSrTy/dB+V1od2q
uHNxA+Luhno37CXU1STrVvSrgHzOm45MROryuOu0lWY+d49tWZN9ilNI2Rf8mJjT
ZVKwJu4v02jXLGAqWpXQX0vxa7nI1D0xkOqnTvd04iDOdDE+jRtiy3SF8508LRqQ
jRH+9TZbX++yFd9Z/AR2h6AwM8OsLSC1QMJG7KeJw8st7K9i8KEOdglpAgEDo1Iw
UDAfBgNVHSMEGDAWgBTrVX/FmGlwJqoQ3fgyj1cJ40A/OjAdBgNVHQ4EFgQUMowN
BX+7Vy5lfO+d+tCxZ+ZupdYwDgYDVR0PAQH/BAQDAgQwMA0GCSqGSIb3DQEBCwUA
A4ICAQA+TV7cAPm5mKIAzTfuS4x4/KAlysTXZ3o0F2fYZmylNnUafi0+T21utPAv
bBYVFpr9fRq+q0L75ZCqU4pDvRLpHF7Q0RZ01ra7otVS78saxc/YUql+MsnHxeUw
9F8FJx7234KlRkhmY8xB743T/LQcp3zCRYUd0Rn2Ocaq7YoYGnx8QALItmJcagsX
MwYVsvXtWHHaDGFpcaivLX3e8cVQ+nI7slq1EfJ5xEdtSZ/zcGv+Ve4S6D1HLQ/K
oTQMzematrVvwwJMuqLMQdA1Pdtau3niupB3Se7AUq0bEZYF04Zlo4sOE21K9gSt
lJ5tSq0ohli02uXuQ/ggsqZSIH4t9WirWOMpS4KFkub02AYaicbm6SUyVg+odEaj
cFz+TEqd9C7cGgBL6MkLxXGj0DX64z4yU9lMlqQ8CzuZi5cMfpxvHVm4E+etLnYf
fzZ6jPnf3RbVumxPaRqnz6vceijWtmESg6cBei+phPzMCjjrXP0xng3+Bzqdn/lY
e8znS54o+UWJcENwvGc6tsUtBYGJOe6srIJHrXQKTG3DN6oDN2U5zT4cUBFvlHjx
fdj14m0Y0+gE90iTUJknWVRyyNDhPbYG1YCHRItVUxpGIp9tsV5FRP5qVbiMC7ba
hEsDAxMvL29i1vJbnJPT9e4OPkhEN5IqVQbu0QeOKMYT/YMZZQ==</X509Certificate>
</X509Data>
</KeyInfo>
<CipherData>
<CipherValue>gtWqHvNbdDBA97INJam0F6FzcWuTxQyiRjCElJlgLN2Mr/fSpE9HS2cc//32Ea/8
qnwTyZ0OSeiRZJoRjXtdAwXCeS9RaXfs6VJVbeIThT9++214HFc9e5pFAuPe1p1o
0CV2Y3hCum0lYVcl7YvxLN4LhZFsN7AvYRumNuPFw/FaoDZz3YbUUBGEdRRIYSgv
HKx/Pan3Bw4X98siPZV6V0APmgCjHhea5PES86WQQSVQHsuvrcATazy05oF6dRxR
7liBUhGtgAvX9PLFPvUMWdXlWYhIsmNQvB4PEEKPXD4/91IcfCzOnla9Mi/Fyq5/
gIDd8JyALxL2/TAft9v7nw==</CipherValue>
</CipherData>
</EncryptedKey>
</KeyInfo>
<CipherData>
<CipherValue>kA2ZhmoFQEraabDaIKNcsag/ikV+r04VutE9khlQYG2zU1aUpCGIc/HxazrlfdpJ
remx3lb6KywGZOoUrDOLFK/Zua9Qvn5SGoOiI32CAZYZwdTEtLWFwTf/PN766fLc
RtvsDZ0NxUF1A0QKNXPPLRJ61URoGdFcSdJkaIIzhi8KR9MmXWXeDf6YqQSdZCN4
fA1X+zuHe6ZFwhx1KgdqQaxY/WiyPEJB3dxqAztBwqvnXoubItPLVKs9ZVFRtcC8
lkMukRU8LFD8U1c5VWEkN2ThAMalMmybFMbNWFPkca7O8GRHgfmhNTi8lUW6lXLV
vc3u15WEEnvHQXqj51ElxI7qABJUHA2pgGx/IQVo6FkzoGuH/9r1lSfirEAsL8af
RQo2Q3HlSh4yxg4OvP2C+SrQulcewi4G2xUJJHv0d6T9z5bkOqgPpqqT98PF6eIi
XecQvk4eyXJPcq3WjC2ZmRS1nO/IlEeyLOuKskj9c0t9j6ylaAWZ+OsisWwamIGT
N72qGRwC1Op4dIj92Yrb6MnjdhstMGFnrD61IOyZzS5nJAxcpMyKpRYYq65soL0E
2sDncdAGFXctvadRmZezTsXXQzOeUCbw2GV1rTZZRtJHCe1ghp0jZEIm8tcNp2dP
BlpPCB86iGRN8R/gjqCoBq6uSnvaw49UoDladN1i/qCd93BFt9qRs0YherzJRAcr
If7+wzsdKojW4YapvWp+cytqRaZm8becGjH+dlnWq6accLBYkqdcRUoS1NxWgTtw
/U/eluDc2v2Cp7M5bU70bxuOku7z386KMmMSy74E3/6uWc09pXNdtV+50CYbkyxY
IuCBlME9BUWYAPuRfGChbDlncBIxVnYCyqDH/bHPUZOU61F8ceYWzqI1QJBKDVBh
y9NSrmBPrsJjwH6q57ywQ0zFxmuyShK+ud5v5i1Pkf6y0JUDQqFKQYbCG3RsDRh1
IyqdMVRSpSXK3oDwUK963+wzQpPsT0sUnNBOWRVfzYmAe2G67AfBsR7cWlZ+hvMO
Sj4QcgetVWcEXhE0//wu44s14pe+/y9cwy2dqzCCp2VxwK3FYjgf8NYRp5lsW6fg
XyQCyQMWDp6Pt//VkpdKkfLMVb+iHP3uuvEPGX3JexEVB4u1T2qW3kb+oWupC4bk
H2KVL+kiUzoCHUjTX2vfg2oYxudP69tMeJMdLbGsqnwnVWrJmGa/PlDqec7X5/V0
oTl7n2cYUq9zke74yRmmlLJmmiK7uDTgCcq8b4QJl4/GRpslrUQImrsrIlfYYmXN
UcVNLi0HBF2hTltgV4KI/hQ78Q9cuN5Ic4FMSfoyNc3xGR8GPdn8xc46Ytm+CNJe
5hm0RU4L4Jx/JM/hcLxUuZJ9LwmVHmkIp5lFzisORzJvRRCTWzCdcW4lLearSb/3
AQCMAHKT0FeTsLpzFammUKjJb1RoIXN9sUdnNE1J/4j1NdJiPYaZiWAO6RE4kowK
La/JMPtwrSjEmPqQ1hfrNhBEiQZ4nGMyhzaM23SDifbkdVxZwcZ6QFnauuHHRDLA
d7/yp8DfSsiL07CjZIPik8JG6eTQQpUBCLRy7cbfgiltlHcS0znKoagUy32RqoUj
L+8ACVFOob7FlRay5wL5sxOXHOcf65p+lJzZZCgwS2ox5plbZEVS8Y/33O1GGAfS
N+AeUP8rMOaEY7T/b5Edqgk0YaizsJRnb8xZvQtK63NKztrdScB5ATg+Yd1mP+EP
UIo+JBllqFU7yCTM3zxEUtSYtzDGUCJWrYeHQ2YbtjgKRmOpSKmX/FhUO2U3TLfN
sHGsXfq2G3vs0KA1zOhEkeP8F0CIdR3a422q4y6Z2jBIPhaSlRpRD31dbI1IFRSr
b0LPBujdZII13U1e8hOZI2ixO4CHqGZK4aLllmzNhGV/wLeAyLdl/lb+B5SvQzTo
l6s7+r7MeNmiPjrwo9V0Zt80ATbtXMJ9ijuT/ws0O9fD8mshEa1CZTAzbNS/d/lZ
CxuRfaxJX/+gRSkICxC7kWmlJ4TOKWzKdDEjQBmNhrrw/MpWKqfdzthC2wQ5RRH+
cjQI7Ianyh70QbCYKm5/fwQKAOE0Gue/DLAOQCvx2szfbgQ4A6zlt+pgrhsx9xdd
DKIe9WAPk8WeHMk5ogRxnR3bTC/ZXnoNIuZusc3n/vUEzH2VCOY5U7wr6IC3pHw4
JtYynn7s4PVhPYLJc2ViLKWVRW8zaqLRS0ZRyXfdp52+HUQBO22seoj1bWhQpHLb
pc83H0vWQ1K3woqrsVcZbU4CTUTLpx4f0cd9RRY/bof2US1WNArg1X6Ng6eJc3/r
6sklSklW9+Cm5z8Q4qo63mMRJI3mXd2kZXuaA9DAEAikIkMeirwbnsxAN28/2n62
7cex8XyDXD05uFhrtk1p26m7C7EYJr/LvTN3rFwUTS/cIQierxSIld54UWg0P4+y
qWK3/0f17RfS2jp/MtsBWbc8o3DDnK+9S3P8b6NThtO+LTA3fwM8kn+Zfe0NECj6
MWkLPghTZksJ7jaQNzBDRoUhYfZQfAhwX6JDdrG/sP8yRSzwoWWIFcYLDDja5zcf
A/NPoZJ8XfXeXzLSfoARqHSFBYs6I5/OUMIjdHHiq7l3xjSDvBPVT4ox86tSpAZj
48I7n9P1y70gF6vPJwQArosZrLUOxowrhuvCjrY386T6J4zs4qp7vCpUmjedmvcn
j9BD6UjWJ+UlJWM03BXYuirecTyJBvLQ0b/FHlDK26owX1JdnnYa5M/U0bnXNGJ3
RA+xu9OHbd56EntykynczaX74mgIIEKvHf4AJa2BaE5Mnrxpf0jUZaORpoorQ03V
AS2WoBHoR7o50JoutuMsm8Ms1VXmKZjtS4LE/P2gwgdfVUxyIa1a2O4JhTCU4G4X
wNdm5P71sDmZCySa2Flsli06/mxX6lykX3BOmiUbn/pa2A+7zZffDEMzmtNRN8OA
FQwMCYabktnSb7ZPslWRcLI6WQzUDUkfKBVrsLJeNSoh0pF/8Eh9rZA1rk8p6ajf
vfN+woBe10jbbbriKlSmQuVIjkmWVZPxrlxyevEIVRtqJKULdE0sEvMccdEHQdMX
u1p2hgFlrlpI6dFiAU5yVsck3jC0w4Kf5KdVVYEubrcr0zBuK+crTZ9cuwAoXXf7
OBtHDOnlVmrGpCeGek7xrh9BQ1bnuP56NI1Ay6vLQHypz08K4aFLc/izYZWv0Ob1
uR1tZ5D9qk8tCZBj4wnrjIQnMlJ3XKF4wWw6uTGyUYwDt8bnN2kqNPDCNOPEgZbI
i1q/uFPQfPeIl+XhpmRXQNmsfOgCYU9cgLNpHHuJSJNbN5VdiS4PGGx7LuKojH9+
7Hdm1eqLcG2KQ/b8+z/i03e1rBISHYjKiTSmyxIcDztKQuZtdlERitO+lzFtMqXO
PENH4tO892fG3n6nKb99MS/E+E4jNmKJ4ujVxA3eMHqEFEDi4HQrvGSIMX6vV5zw
v+2GkLpYNFytFcf2Vl1oTb9JSKxPzXR/QuK2XYMC+YXgR8Y9SK0geY7qugocgoHQ
tEj15tXR2nxvOB5nbSePN+wo2U03Z6KfMBfoDgUszqvAdSzrFVP7tQ==</CipherValue>
</CipherData>
</EncryptedData></pkif:CreateCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>